In [1]:
import numpy as numpy
import pandas as pandas

In [2]:
dictionary = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
              "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
             "Kalori" : [100,200,300,400]
             }

In [3]:
dataFrame1 = pandas.DataFrame(dictionary,index=[0,1,2,3])

In [5]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [8]:
dictionary2 = {"Isim": ["Osman","Levent","Atlas","Fatma"],
              "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
             "Kalori" : [200,100,50,300]
             }

In [9]:
dataFrame2 = pandas.DataFrame(dictionary2,index=[4,5,6,7] )

In [14]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [15]:
dictionary3 = {"Isim": ["Ayşe","Mahmut","Duygu","Nur"],
              "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
             "Kalori" : [300,400,500,250]
             }

In [16]:
dataFrame3 = pandas.DataFrame(dictionary3,index=[8,9,10,11])

In [17]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## Concatenation

In [23]:
pandas.concat([dataFrame1,dataFrame2,dataFrame3],axis=1) # axis = 1 Concatenation column

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atıl,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Koşu,200.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yüzme,100.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Koşu,50.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,300.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayşe,Koşu,300.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yüzme,400.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,500.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,250.0

In [24]:
pandas.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## Merge

In [26]:
mergeDictionary1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
                   "Spor" : ["Running","Swim","Running","Basketball"]
                   }

In [27]:
mergeDictionary2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
                   "Kalori" : [100,200,250,150]
                   }

In [28]:
mergeDataFrame1 = pandas.DataFrame(mergeDictionary1)

In [29]:
mergeDataFrame1

     Isim        Spor
0   Ahmet     Running
1  Mehmet        Swim
2  Zeynep     Running
3    Atıl  Basketball

In [30]:
mergeDataFrame2 = pandas.DataFrame(mergeDictionary2)

In [31]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Atıl     150

In [32]:
pandas.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim        Spor  Kalori
0   Ahmet     Running     100
1  Mehmet        Swim     200
2  Zeynep     Running     250
3    Atıl  Basketball     150

In [39]:
newSalaryDictionary = {"Isim":["Atıl","Zeynep","Mehmet","Ahmet"],
                      "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
                       "Maas":[200,300,400,500]
                      }

In [40]:
newSalaryDataFrame = pandas.DataFrame(newSalaryDictionary)

In [41]:
newSalaryDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [42]:
newSalaryDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [43]:
newSalaryDataFrame["Departman"].nunique()

3

In [44]:
newSalaryDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [46]:
newSalaryDataFrame["Maas"] * 0.66

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [47]:
def bruttenNete(maas):
    return maas * 0.66

In [49]:
newSalaryDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [50]:
newSalaryDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [56]:
newOneData = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
           "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
            "Karakter Yas" : [9,10,50,20,10]
           }

In [57]:
newCartoonDataFrame = pandas.DataFrame(newOneData)

In [58]:
newCartoonDataFrame

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [62]:
newCartoonDataFrame.pivot_table(values = "Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [64]:
newCartoonDataFrame.pivot_table(values = "Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"],aggfunc=numpy.sum) #default toplar ortalama alır :  aggfunc = numpy.sum yaparsak toplar sadece

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10